def fun_result(rnd):
    result = "Помилка. Скоріше за все проблема на стороні random.org"
    if rnd == 1:
        result = "Зеро! 🟢 Зелений"
    if rnd == 2:
        result = "32, 🔴 Червоний"
    if rnd == 3:
        result = "15, ⚫ Чорний"
    if rnd == 4:
        result = "19, 🔴 Червоний"
    if rnd == 5:
        result = "4, ⚫ Чорний"
    if rnd == 6:
        result = "21, 🔴 Червоний"
    if rnd == 7:
        result = "2, ⚫ Чорний"
    if rnd == 8:
        result = "25, 🔴 Червоний"
    if rnd == 9:
        result = "17, ⚫ Чорний"
    if rnd == 10:
        result = "34, 🔴 Червоний"
    if rnd == 11:
        result = "6, ⚫ Чорний"
    if rnd == 12:
        result = "27, 🔴 Червоний"
    if rnd == 13:
        result = "13, ⚫ Чорний"
    if rnd == 14:
        result = "36, 🔴 Червоний"
    if rnd == 15:
        result = "11, ⚫ Чорний"
    if rnd == 16:
        result = "30, 🔴 Червоний"
    if rnd == 17:
        result = "8, ⚫ Чорний"
    if rnd == 18:
        result = "23, 🔴 Червоний"
    if rnd == 19:
        result = "10, ⚫ Чорний"
    if rnd == 20:
        result = "5, 🔴 Червоний"
    if rnd == 21:
        result = "24, ⚫ Чорний"
    if rnd == 22:
        result = "16, 🔴 Червоний"
    if rnd == 23:
        result = "33, ⚫ Чорний"
    if rnd == 24:
        result = "1, 🔴 Червоний"
    if rnd == 25:
        result = "20, ⚫ Чорний"
    if rnd == 26:
        result = "14, 🔴 Червоний"
    if rnd == 27:
        result = "31, ⚫ Чорний"
    if rnd == 28:
        result = "9, 🔴 Червоний"
    if rnd == 29:
        result = "22, ⚫ Чорний"
    if rnd == 30:
        result = "18, 🔴 Червоний"
    if rnd == 31:
        result = "29, ⚫ Чорний"
    if rnd == 32:
        result = "7, 🔴 Червоний"
    if rnd == 33:
        result = "28, ⚫ Чорний"
    if rnd == 34:
        result = "12, 🔴 Червоний"
    if rnd == 35:
        result = "35, ⚫ Чорний"
    if rnd == 36:
        result = "3, 🔴 Червоний"
    if rnd == 37:
        result = "26, ⚫ Чорний"

    return result
