TOKEN = "bot_token"

enablelog = True

helpmsg = "<b>Ось список доступних команд:</b>\n\n" \
          "<b>/roll</b> - Грати в рулетку (Також є на клавіатурі)\n\n" \
          "<b>/orlanka</b> - Грати в орлянку (орел або решка)\n\n" \
          "<b>/dice</b> - Підкинути кістки\n\n" \
          "<b>/fact</b> - Випадковий факт про цього робота (Також є на клавіатурі)\n\n" \
          "<b>/disclaimer</b> - Відмова від відповідальності\n\n" \
          "<b>/author</b> - Автор бота\n\n" \
          "<b>/ping</b> - Понг!\n\n" \
          "<b>/keyboard</b> - Відкрити заново клавіатуру для гри\n\n" \
          "<b>/rm_keyboard</b> - Закрити клавіатуру. Корисно у групах (Також є на клавіатурі)\n\n" \
          "<b>/help</b> - Показати всі команди"
