TOKEN = "bot_token"
# token

# options
enablelog = True
howmanyfacts = 5

# strings
helpmsg = "<b>Ось список доступних команд:</b>\n\n" \
          "<b>/roll</b> - Грати в рулетку (Також є на клавіатурі)\n\n" \
          "<b>/orlanka</b> - Грати в орлянку (орел або решка)\n\n" \
          "<b>/dice</b> - Підкинути кістки\n\n" \
          "<b>/fact</b> - Випадковий факт про цього робота (Також є на клавіатурі)\n\n" \
          "<b>/disclaimer</b> - Відмова від відповідальності\n\n" \
          "<b>/author</b> - Автор бота\n\n" \
          "<b>/ping</b> - Понг!\n\n" \
          "<b>/keyboard</b> - Відкрити заново клавіатуру для гри\n\n" \
          "<b>/rm_keyboard</b> - Закрити клавіатуру. Корисно у групах (Також є на клавіатурі)\n\n" \
          "<b>/help</b> - Показати всі команди"

disclaimer_text = "<b>ДИСКЛЕЙМЕР (ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ):" \
                " </b>Я повністю відмовляюся від результатів використання даного бота не з метою розваги." \
                " Бот створений не з комерційною метою, і ніколи таким не " \
                "стане!\n\n<b>Коротко:</b> Ставок нема."


fact1 = f"Цей бот є FOSS проектом. Це означає, що його" \
        f" <a href='github.com/KUKURUZKA165/roulette-telegram-bot'>вихідний код</a>" \
        f" відкритий усім охочим. Будь-хто може перевірити чесність його роботи :)"

fact2 = f"Випадковість у цьому роботі реалізована через атмосферний шум (random.org)." \
        f" Сучасні технології не здатні передбачити результат вашої гри."

fact3 = f"Бот знає тільки {howmanyfacts} фактів себе." \
        f" Він просто перебирає факти випадково і відправляє вам."

fact4 = f"Цей факт ще не придумали. Я не знаю що тут написати("

fact5 = f"Навіть якби всі казино використовували такий самий спосіб отримання" \
        f" випадкових чисел, як у нас, вони все одно залишалися б у плюсі."
